{
  "artist": {
    "name": "Queen",
    "mbid": "420ca290-76c5-41af-999e-564d7c71f1a7",
    "url": "https://www.last.fm/music/Queen",
    "image": [
      {
        "text": "https://lastfm-img2.akamaized.net/i/u/34s/39be92dbb8013de8cd1dafc3430ff3d8.png",
        "size": "small"
      },
      {
        "text": "https://lastfm-img2.akamaized.net/i/u/64s/39be92dbb8013de8cd1dafc3430ff3d8.png",
        "size": "medium"
      },
      {
        "text": "https://lastfm-img2.akamaized.net/i/u/174s/39be92dbb8013de8cd1dafc3430ff3d8.png",
        "size": "large"
      },
      {
        "text": "https://lastfm-img2.akamaized.net/i/u/300x300/39be92dbb8013de8cd1dafc3430ff3d8.png",
        "size": "extralarge"
      },
      {
        "text": "https://lastfm-img2.akamaized.net/i/u/300x300/39be92dbb8013de8cd1dafc3430ff3d8.png",
        "size": "mega"
      },
      {
        "text": "https://lastfm-img2.akamaized.net/i/u/300x300/39be92dbb8013de8cd1dafc3430ff3d8.png",
        "size": ""
      }
    ],
    "streamable": "0",
    "ontour": "0",
    "stats": { "listeners": "4000284", "playcount": "188213496" },
    "similar": {
      "artist": [
        {
          "name": "Freddie Mercury",
          "url": "https://www.last.fm/music/Freddie+Mercury",
          "image": [
            {
              "text": "https://lastfm-img2.akamaized.net/i/u/34s/0a03d44d813f4eca95eb29fb44cad5ed.png",
              "size": "small"
            },
            {
              "text": "https://lastfm-img2.akamaized.net/i/u/64s/0a03d44d813f4eca95eb29fb44cad5ed.png",
              "size": "medium"
            },
            {
              "text": "https://lastfm-img2.akamaized.net/i/u/174s/0a03d44d813f4eca95eb29fb44cad5ed.png",
              "size": "large"
            },
            {
              "text": "https://lastfm-img2.akamaized.net/i/u/300x300/0a03d44d813f4eca95eb29fb44cad5ed.png",
              "size": "extralarge"
            },
            {
              "text": "https://lastfm-img2.akamaized.net/i/u/300x300/0a03d44d813f4eca95eb29fb44cad5ed.png",
              "size": "mega"
            },
            {
              "text": "https://lastfm-img2.akamaized.net/i/u/300x300/0a03d44d813f4eca95eb29fb44cad5ed.png",
              "size": ""
            }
          ]
        },
        {
          "name": "Brian May",
          "url": "https://www.last.fm/music/Brian+May",
          "image": [
            {
              "text": "https://lastfm-img2.akamaized.net/i/u/34s/30195463eea54946afd1e0de6fe832ef.png",
              "size": "small"
            },
            {
              "text": "https://lastfm-img2.akamaized.net/i/u/64s/30195463eea54946afd1e0de6fe832ef.png",
              "size": "medium"
            },
            {
              "text": "https://lastfm-img2.akamaized.net/i/u/174s/30195463eea54946afd1e0de6fe832ef.png",
              "size": "large"
            },
            {
              "text": "https://lastfm-img2.akamaized.net/i/u/300x300/30195463eea54946afd1e0de6fe832ef.png",
              "size": "extralarge"
            },
            {
              "text": "https://lastfm-img2.akamaized.net/i/u/300x300/30195463eea54946afd1e0de6fe832ef.png",
              "size": "mega"
            },
            {
              "text": "https://lastfm-img2.akamaized.net/i/u/300x300/30195463eea54946afd1e0de6fe832ef.png",
              "size": ""
            }
          ]
        },
        {
          "name": "Roger Taylor",
          "url": "https://www.last.fm/music/Roger+Taylor",
          "image": [
            {
              "text": "https://lastfm-img2.akamaized.net/i/u/34s/1ed0d1611cf5427396f48f5b3f79d227.png",
              "size": "small"
            },
            {
              "text": "https://lastfm-img2.akamaized.net/i/u/64s/1ed0d1611cf5427396f48f5b3f79d227.png",
              "size": "medium"
            },
            {
              "text": "https://lastfm-img2.akamaized.net/i/u/174s/1ed0d1611cf5427396f48f5b3f79d227.png",
              "size": "large"
            },
            {
              "text": "https://lastfm-img2.akamaized.net/i/u/300x300/1ed0d1611cf5427396f48f5b3f79d227.png",
              "size": "extralarge"
            },
            {
              "text": "https://lastfm-img2.akamaized.net/i/u/300x300/1ed0d1611cf5427396f48f5b3f79d227.png",
              "size": "mega"
            },
            {
              "text": "https://lastfm-img2.akamaized.net/i/u/300x300/1ed0d1611cf5427396f48f5b3f79d227.png",
              "size": ""
            }
          ]
        },
        {
          "name": "Freddie Mercury & Montserrat Caballé",
          "url": "https://www.last.fm/music/Freddie+Mercury+&+Montserrat+Caball%C3%A9",
          "image": [
            {
              "text": "https://lastfm-img2.akamaized.net/i/u/34s/1ab874c5489a4fa9b65c9c991fad956e.png",
              "size": "small"
            },
            {
              "text": "https://lastfm-img2.akamaized.net/i/u/64s/1ab874c5489a4fa9b65c9c991fad956e.png",
              "size": "medium"
            },
            {
              "text": "https://lastfm-img2.akamaized.net/i/u/174s/1ab874c5489a4fa9b65c9c991fad956e.png",
              "size": "large"
            },
            {
              "text": "https://lastfm-img2.akamaized.net/i/u/300x300/1ab874c5489a4fa9b65c9c991fad956e.png",
              "size": "extralarge"
            },
            {
              "text": "https://lastfm-img2.akamaized.net/i/u/300x300/1ab874c5489a4fa9b65c9c991fad956e.png",
              "size": "mega"
            },
            {
              "text": "https://lastfm-img2.akamaized.net/i/u/300x300/1ab874c5489a4fa9b65c9c991fad956e.png",
              "size": ""
            }
          ]
        },
        {
          "name": "Queen + Paul Rodgers",
          "url": "https://www.last.fm/music/Queen+%252B+Paul+Rodgers",
          "image": [
            {
              "text": "https://lastfm-img2.akamaized.net/i/u/34s/87b543ae63434735bfed55a3fd37b9ac.png",
              "size": "small"
            },
            {
              "text": "https://lastfm-img2.akamaized.net/i/u/64s/87b543ae63434735bfed55a3fd37b9ac.png",
              "size": "medium"
            },
            {
              "text": "https://lastfm-img2.akamaized.net/i/u/174s/87b543ae63434735bfed55a3fd37b9ac.png",
              "size": "large"
            },
            {
              "text": "https://lastfm-img2.akamaized.net/i/u/300x300/87b543ae63434735bfed55a3fd37b9ac.png",
              "size": "extralarge"
            },
            {
              "text": "https://lastfm-img2.akamaized.net/i/u/300x300/87b543ae63434735bfed55a3fd37b9ac.png",
              "size": "mega"
            },
            {
              "text": "https://lastfm-img2.akamaized.net/i/u/300x300/87b543ae63434735bfed55a3fd37b9ac.png",
              "size": ""
            }
          ]
        }
      ]
    },
    "tags": {
      "tag": [
        {
          "name": "classic rock",
          "url": "https://www.last.fm/tag/classic+rock"
        },
        { "name": "rock", "url": "https://www.last.fm/tag/rock" },
        { "name": "80s", "url": "https://www.last.fm/tag/80s" },
        {
          "name": "hard rock",
          "url": "https://www.last.fm/tag/hard+rock"
        },
        {
          "name": "glam rock",
          "url": "https://www.last.fm/tag/glam+rock"
        }
      ]
    },
    "bio": {
      "links": {
        "link": {
          "text": "",
          "rel": "original",
          "href": "https://last.fm/music/Queen/+wiki"
        }
      },
      "published": "10 Feb 2006, 19:01",
      "summary": "\nQueen were an English rock band originally consisting of four members: vocalist and pianist Freddie Mercury, guitarist Brian May, bass guitarist John Deacon, and drummer Roger Taylor.\n\nThe band formed in London in 1970 after May and Taylor's former band Smile split after having released an album and single. Freddie replaced lead vocalist Tim Staffell, after the latter's departure from the original trio. \n\nThere was much deliberation as to what the band's name would be. <a href=\"https://www.last.fm/music/Queen\">Read more on Last.fm</a>",
      "content": "\nQueen were an English rock band originally consisting of four members: vocalist and pianist Freddie Mercury, guitarist Brian May, bass guitarist John Deacon, and drummer Roger Taylor.\n\nThe band formed in London in 1970 after May and Taylor's former band Smile split after having released an album and single. Freddie replaced lead vocalist Tim Staffell, after the latter's departure from the original trio. \n\nThere was much deliberation as to what the band's name would be. May and Taylor had settled upon the Grand Dance, derived from a C.S. Lewis Trilogy of books Out Of The Silent Planet.\n\nUltimately, the band went with Queen, a name that was entirely Freddie's. Originally Roger and, especially, Brian did not like the name, though Mercury would eventually persuade them both that it was \"right\" for the band.\n\n\"Years ago I thought up the name Queen... It's just a name, but it's very regal, and it sounds splendid. It's a strong name, very universal and immediate. It had a lot of visual potential and was open to all sorts of interpretations. I was certainly aware of the gay connotations, but that was just one facet of it. \"\n- Freddie Mercury.\n\nQueen went through several bass players before  a young electronics major by the name of John Deacon arrived on the scene in January of 1971. \n\n\"Until John, it had been exploding bass player syndrome. If they musically worked they'd look all wrong, and if they felt all right they couldn't play. - Brian May.\n\nThis quite shy guy turned up with his immaculate Rickenbacker bass and immaculate amplifier, plugged in, and as soon as he started playing we realized it was right.\" - Brian May.\n\nLater that year, the band was secured recording time at the newly built De Lane Lea studio, and used the opportunity to record several songs that would later appear on their debut album - Liar, Keep Yourself Alive, Jesus, and The Night Comes Down.  The demo reel was passed around from producer to producer with little success, until a staff member of Trident records by the name of Roy Thomas Baker was introduced to the band by fellow Trident producer John Anthony. Baker dropped in to watch the band at work and, clearly liking what he heard, recommended Queen to his superiors. \n\nIt was eventually agreed upon that the fledgling band could record at Trident studios, though after already-established artists had finished their work, such as the likes of Elton John and David Bowie. Relegated to the wee hours of the morning to record the remaining tracks of their first album, the band nonetheless stuck it out until they reached their ultimate goal of \"perfection\".\n\nQueen's self-titled debut album was released in 1973 and received little attention from the general public. They quickly followed it a year later with a second album, \"Queen II\" which also failed to generate much interest from music fans in Britain, despite the success of the album's single, Seven Seas of Rhye, which would reach #10 on the charts after the band's mimed appearance on Top of the Pops. \n\nThe band's second album was recorded with a higher budget than the first, and the band threw everything they had into recording it. Queen II was somewhat of a \"concept album\", split into \"White Side\" vs. \"Black Side\". \n\nAs was in their nature, the band pressed onward after the mediocre success of their first two albums, immersing themselves in a world-wide tour to promote Queen II. Queen played in America for the first time, as a support act for Mott the Hoople.\n\nSheer Heart Attack would be released later that year, focusing more on being accessible to listeners, than the grand and complex ideas of the previous two albums. The recording of their third album was met with some hardships, as May fell victim to a series of illnesses brought on by an infected inoculation, required for the band's rigorous touring schedule. \n\nSheer Heart Attack brought even more success for the band, with May's Now I'm Here and the song that would be the band's \"turning point\", the Mercury-penned Killer Queen, the latter of which would reach #2 on the UK charts.\n\nDuring this time, the band began developing a huge following in Japan and witnessed their popularity for themselves when they visited the country, mainly in 1975, to promote their fourth and most famous album \"A Night At The Opera\", featuring the epic \"Bohemian Rhapsody\".\n\nQueen's popularity grew steadily through the latter half of the 70s as they released hit album after hit album, reaching its peak in the mid-80s after their \"Live Aid\" appearance, and continuing into the early 90s before Mercury's untimely death on 24th November 1991. The official cause of death was bronchial pneumonia resulting from AIDS.\n\nOver the course of their 30 year career, the band did sound tracks for two films (\"Flash Gordon\" and \"Highlander\"), released a string of live and studio albums, and had many many fans across the world.\n\nIn 1995, 4 years after Mercury's death, the band released the album \"Made In Heaven\". This album saw the surviving band members in the studio completing or reworking unused vocals, unreleased variations of Freddie solo material (a Queen version of \"I Was Born To Love You\" for example), and tracks where Brian and Roger added lyrics to flesh out a song (\"Mother Love\"). \n\nQueen have been on indefinite hiatus since 1997, when John Deacon decided to retire.\n\n\nSeveral \"Queen + ...\" projects have been developed in the following years, a few of them mere remixes with no artistic involvement from the band. In 1999, a \"Greatest Hits III\" album was released. This featured, among others, \"Queen + Wyclef Jean\" on a rap version of \"Another One Bites the Dust\", a live version of \"Somebody to Love\" performed by George Michael, and a live version of \"The Show Must Go On\" performed live in 1997 with Elton John.\n\nBrian May and Roger Taylor have performed together as Queen on several occasions (award ceremonies, charity concerts, and the like), sharing vocals with various guest singers. They have also recorded several covers of Queen's hits with guest vocalists, including \"We Will Rock You\" (first with Five and later Britney Spears, Beyonce, John Farnham and P!nk) and \"We Are the Champions\" (with Robbie Williams).\n\nOn the 14th of May 2002 the Queen musical 'We Will Rock You'  opened in the Dominion theatre in London's 'West End'. A Musical about young people in the distant future who aren't allowed to listen to music not generated by computers. Various Queen songs are used in the story, played by a live band. This live band was supported by Brian May and Roger Taylor on the premiere evening.\n\nAt the end of 2004, May and Taylor announced that they would reunite and return to touring in 2005, with Paul Rodgers (founder and former lead singer of Free and Bad Company). Brian May's website also stated that Rodgers would be 'featured with' Queen as 'Queen + Paul Rodgers', not replacing Mercury. The retired John Deacon would not be participating.\n\nBetween 2005 and 2006 Queen + Paul Rodgers embarked on a world tour, the first leg in Europe and the second, Japan and then the US in 2006. On 15 August 2006, Brian May confirmed through his website and fan club that Queen + Paul Rodgers would begin producing their first studio album beginning in October, to be recorded at a \"secret location\". The album, titled The Cosmos Rocks, was released in Europe on 12 September 2008 and in the United States on 28 October 2008. Following the album the band again embarked on a tour through Europe, opening on Kharkiv's Freedom Square in front of 350,000 Ukrainian fans. The show in Ukraine was later released on DVD.\n\nQueen and Paul Rodgers officially split up without animosity on 12 May 2009. Rodgers did not rule out the possibility of working together again.\n\nMore information about Queen + Paul Rodgers can be found on their last.fm page.\n\nOfficial website: www.queenonline.com\n\nDiscography:\n1.- Queen (1973)\n2.- Queen II (1974)\n3.- Sheer Heart Attack (1974)\n4.- A Night at the Opera (1975)\n5.- A Day at the Races (1976)\n6.- News of the World (1977)\n7.- Jazz (1978)\n8.- The Game (1980)\n9.- Flash Gordon (1980)\n10.- Hot Space (1982)\n11.- The Works (1984)\n12.- A Kind of Magic (1986)\n13.- The Miracle (1989)\n14.- Innuendo (1991)\n15.- Made in Heaven (1995) <a href=\"https://www.last.fm/music/Queen\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}
